In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ["Abhinav", "Rahul", "Shivansh", "Display"],
    "marks" : [93, 4, 66, 33],
    "city" : ["Mumbai", "kalyan", "Madhubani", "Kolkata"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

       name  marks       city
0   Abhinav     93     Mumbai
1     Rahul      4     kalyan
2  Shivansh     66  Madhubani
3   Display     33    Kolkata

In [5]:
df.to_csv("friends.csv")

In [6]:
df.to_csv("friends_indexFalse.csv", index=False)

In [7]:
df.head(2)

      name  marks    city
0  Abhinav     93  Mumbai
1    Rahul      4  kalyan

In [8]:
df.tail(2)

       name  marks       city
2  Shivansh     66  Madhubani
3   Display     33    Kolkata

In [9]:
df.tail(10)

       name  marks       city
0   Abhinav     93     Mumbai
1     Rahul      4     kalyan
2  Shivansh     66  Madhubani
3   Display     33    Kolkata

In [10]:
df.describe()

           marks
count   4.000000
mean   49.000000
std    38.755645
min     4.000000
25%    25.750000
50%    49.500000
75%    72.750000
max    93.000000

In [15]:
train = pd.read_csv("train.csv")

In [16]:
train["Speed"]

0    129
1    123
2    200
3     90
Name: Speed, dtype: int64

In [20]:
train["city"][0]

'Mumbai'

In [22]:
train['city'][3] = "Patna"

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_2500/3634185913.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['city'][3] = "Patna"

In [35]:
train.to_csv("train.csv", index=False)

In [31]:
train

   Tain no.  Speed    city
0    893009    129  Mumbai
1    239843    123   Delhi
2    234323    200    Kota
3    324234     90   Patna

In [39]:
train.index = ["First", "Second", "Third", "Fourth"]

In [40]:
train

        Tain no.  Speed    city
First     893009    129  Mumbai
Second    239843    123   Delhi
Third     234323    200    Kota
Fourth    324234     90   Patna

In [41]:
series = pd.Series(np.random.rand(20))

In [45]:
print(series, type(series))

0     0.911094
1     0.889643
2     0.558976
3     0.882592
4     0.667594
5     0.510552
6     0.836486
7     0.682268
8     0.753468
9     0.946913
10    0.077572
11    0.160004
12    0.848981
13    0.395211
14    0.220178
15    0.466445
16    0.928735
17    0.635776
18    0.678065
19    0.195628
dtype: float64 <class 'pandas.core.series.Series'>

In [46]:
new_df = pd.DataFrame(np.random.rand(445, 6), index=np.arange(445))

In [48]:
new_df.head()

          0         1         2         3         4         5
0  0.007183  0.395390  0.082126  0.281614  0.195366  0.045921
1  0.236019  0.860426  0.851695  0.196587  0.928201  0.903020
2  0.535283  0.336314  0.924047  0.119805  0.411945  0.193908
3  0.390190  0.950905  0.628961  0.448676  0.959697  0.622484
4  0.961103  0.571048  0.256190  0.418562  0.320952  0.169728

In [49]:
new_df.tail()

            0         1         2         3         4         5
440  0.980522  0.903260  0.538580  0.449161  0.780576  0.768242
441  0.794704  0.682369  0.232860  0.089128  0.328517  0.208230
442  0.874377  0.518364  0.588878  0.367563  0.873444  0.836566
443  0.743553  0.346816  0.135860  0.994409  0.056753  0.938937
444  0.917756  0.669028  0.541190  0.892909  0.802133  0.009524

In [50]:
new_df.describe()

                0           1           2           3           4           5
count  445.000000  445.000000  445.000000  445.000000  445.000000  445.000000
mean     0.541524    0.492773    0.512751    0.492431    0.497410    0.499877
std      0.299748    0.288431    0.295013    0.282765    0.282054    0.284303
min      0.001457    0.006705    0.002991    0.003423    0.006254    0.001605
25%      0.283470    0.238902    0.244599    0.260413    0.276537    0.252488
50%      0.586107    0.481892    0.517574    0.470643    0.521964    0.497357
75%      0.798971    0.741421    0.772238    0.745092    0.735273    0.736966
max      0.999565    0.997606    0.997347    0.998598    0.999256    0.997903

In [51]:
print(type(new_df))

<class 'pandas.core.frame.DataFrame'>

In [52]:
new_df[0][0] = "Abhinav"

In [56]:
new_df.dtypes

          0         1         2         3         4         5
0   Abhinav  0.395390  0.082126  0.281614  0.195366  0.045921
1  0.236019  0.860426  0.851695  0.196587  0.928201  0.903020
2  0.535283  0.336314  0.924047  0.119805  0.411945  0.193908
3   0.39019  0.950905  0.628961  0.448676  0.959697  0.622484
4  0.961103  0.571048  0.256190  0.418562  0.320952  0.169728

In [55]:
new_df.head()

          0         1         2         3         4         5
0   Abhinav  0.395390  0.082126  0.281614  0.195366  0.045921
1  0.236019  0.860426  0.851695  0.196587  0.928201  0.903020
2  0.535283  0.336314  0.924047  0.119805  0.411945  0.193908
3   0.39019  0.950905  0.628961  0.448676  0.959697  0.622484
4  0.961103  0.571048  0.256190  0.418562  0.320952  0.169728